# Fall 2024 Data Science Track: Week 2 - Data Cleaning Exercise

## Packages, Packages, Packages!

Import *all* the things here! You need the standard stuff: `pandas` and `numpy`.

If you got more stuff you want to use, add them here too. 🙂

In [1]:
# Import here.
import pandas as pd
import numpy as np

## Introduction

With the packages out of the way, now you will be working with the following data sets:

* `food_coded.csv`: [Food choices](https://www.kaggle.com/datasets/borapajo/food-choices?select=food_coded.csv) from Kaggle
* `Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv`: [Ask A Manager Salary Survey 2021 (Responses)](https://docs.google.com/spreadsheets/d/1IPS5dBSGtwYVbjsfbaMCYIWnOuRmJcbequohNxCyGVw/view?&gid=1625408792) as *Tab Separated Values (.tsv)* from Google Docs

Each one poses different challenges. But you’ll―of course―overcome them with what you learned in class! 😉

## Food Choices Data Set

### Load the Data

In [2]:
# Load the Food choices data set into a variable (e.g., df_food).

food_data_set_path = 'data/food_coded.csv'

df_food = pd.read_csv(food_data_set_path)

### Explore the Data

How much data did you just load?

In [6]:
# Count by hand. (lol kidding)
df1 = df_food.shape[0]
df2 = df_food.shape[1]

print(df1, df2)

#about 125 rows, 61 columns

125 61

What are the columns and their types in this data set?

In [8]:
df_food.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125 entries, 0 to 124
Data columns (total 61 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   GPA                           123 non-null    object
 1   Gender                        125 non-null    int64
 2   breakfast                     125 non-null    int64
 3   calories_chicken              125 non-null    int64
 4   calories_day                  106 non-null    float64
 5   calories_scone                124 non-null    float64
 6   coffee                        125 non-null    int64
 7   comfort_food                  124 non-null    object
 8   comfort_food_reasons          123 non-null    object
 9   comfort_food_reasons_coded    106 non-null    float64
 10  cook                          122 non-null    float64
 11  comfort_food_reasons_coded.1  125 non-null    int64
 12  cuisine                       108 non-null    float64
 13  diet_current                  124 non-null    object
 14  diet_current_coded            125 non-null    int64
 15  drink                         123 non-null    float64
 16  eating_changes                122 non-null    object
 17  eating_changes_coded          125 non-null    int64
 18  eating_changes_coded1         125 non-null    int64
 19  eating_out                    125 non-null    int64
 20  employment                    116 non-null    float64
 21  ethnic_food                   125 non-null    int64
 22  exercise                      112 non-null    float64
 23  father_education              124 non-null    float64
 24  father_profession             122 non-null    object
 25  fav_cuisine                   123 non-null    object
 26  fav_cuisine_coded             125 non-null    int64
 27  fav_food                      123 non-null    float64
 28  food_childhood                124 non-null    object
 29  fries                         125 non-null    int64
 30  fruit_day                     125 non-null    int64
 31  grade_level                   125 non-null    int64
 32  greek_food                    125 non-null    int64
 33  healthy_feeling               125 non-null    int64
 34  healthy_meal                  124 non-null    object
 35  ideal_diet                    124 non-null    object
 36  ideal_diet_coded              125 non-null    int64
 37  income                        124 non-null    float64
 38  indian_food                   125 non-null    int64
 39  italian_food                  125 non-null    int64
 40  life_rewarding                124 non-null    float64
 41  marital_status                124 non-null    float64
 42  meals_dinner_friend           122 non-null    object
 43  mother_education              122 non-null    float64
 44  mother_profession             123 non-null    object
 45  nutritional_check             125 non-null    int64
 46  on_off_campus                 124 non-null    float64
 47  parents_cook                  125 non-null    int64
 48  pay_meal_out                  125 non-null    int64
 49  persian_food                  124 non-null    float64
 50  self_perception_weight        124 non-null    float64
 51  soup                          124 non-null    float64
 52  sports                        123 non-null    float64
 53  thai_food                     125 non-null    int64
 54  tortilla_calories             124 non-null    float64
 55  turkey_calories               125 non-null    int64
 56  type_sports                   99 non-null     object
 57  veggies_day                   125 non-null    int64
 58  vitamins                      125 non-null    int64
 59  waffle_calories               125 non-null    int64
 60  weight                        123 non-null    object
dtypes: float64(20), int64(27), object(14)
memory usage: 59.7+ KB

### Clean the Data

Perhaps we’d like to know more another day, but the team is really interested in just the relationship between calories (`calories_day`) and weight. …and maybe gender.

Can you remove the other columns?

In [21]:
# Remove ‘em.
columns_to_keep = ['Gender', 'calories_day', 'weight']

#Here i take the inverse instead of naming every column i wanted to drop however gender is not showing 
df_food = df_food.drop(df_food.columns.difference(columns_to_keep), axis=1)


df_food

     calories_day                    weight
0             NaN                       187
1             3.0                       155
2             4.0  I'm not answering this.
3             3.0             Not sure, 240
4             2.0                       190
..            ...                       ...
120           4.0                       156
121           2.0                       180
122           NaN                       120
123           4.0                       135
124           NaN                       135

[125 rows x 2 columns]

What about `NaN`s? How many are there?

In [22]:
# Count ‘em.

nan_counts = df_food.isna().sum()

# Display the result
print(nan_counts)

calories_day    19
weight           2
dtype: int64

We gotta remove those `NaN`s―the entire row.

In [23]:
# Drop ‘em.

df_dropped = df_food.dropna()
df_dropped

#Looks like we now have 104 rows

     calories_day                    weight
1             3.0                       155
2             4.0  I'm not answering this.
3             3.0             Not sure, 240
4             2.0                       190
5             3.0                       190
..            ...                       ...
118           3.0                       140
119           3.0                       185
120           4.0                       156
121           2.0                       180
123           4.0                       135

[104 rows x 2 columns]

But what about the weird non-numeric values in the column obviously meant for numeric data?

Notice the data type of that column from when you got the types of all the columns?

If only we could convert the column to a numeric type and drop the rows with invalid values. 🤔

In [24]:
# Fix that.

df_food.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125 entries, 0 to 124
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   calories_day  106 non-null    float64
 1   weight        123 non-null    object
dtypes: float64(1), object(1)
memory usage: 2.1+ KB

Now this data seems reasonably clean for our purposes! 😁

Let’s save it somewhere to be shipped off to another teammate. 💾

In [57]:
# Savey save!

output_file_path = 'filtered_df_food.csv'
df_food.to_csv(output_file_path, index=False)

## Ask a Manager Salary Survey 2021 (Responses) Data Set

### Load the Data

In [29]:
# Load the Ask A Manager Salary Survey 2021 (Responses) data set into a variable (e.g., df_salary).

manager_data_set_path = 'data/ask_a_manager_salary_survey_2021_responses_form_responses_1.tsv'

df_salary = pd.read_csv(manager_data_set_path, delimiter='\t')

Was that hard? 🙃

#### rename the file to something that is better for all systems.  
* No spaces in filename (can use '_')
* all lower case

### Explore

You know the drill.

How much data did you just load?

In [32]:
# Count by hand. I’m dead serious.

df1 = df_salary.shape[0]
df2 = df_salary.shape[1]

print(df1, df2)

#About 28,000 rows

28062 18

What are the columns and their types?

In [33]:
# Show the column names and their types.

df_salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28062 entries, 0 to 28061
Data columns (total 18 columns):
 #   Column                                                                                                                                                                                                                                Non-Null Count  Dtype
---  ------                                                                                                                                                                                                                                --------------  -----
 0   Timestamp                                                                                                                                                                                                                             28062 non-null  object
 1   How old are you?                                                                                                                                                                                                                      28062 non-null  object
 2   What industry do you work in?                                                                                                                                                                                                         27988 non-null  object
 3   Job title                                                                                                                                                                                                                             28061 non-null  object
 4   If your job title needs additional context, please clarify here:                                                                                                                                                                      7262 non-null   object
 5   What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)  28062 non-null  object
 6   How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.                                        20766 non-null  float64
 7   Please indicate the currency                                                                                                                                                                                                          28062 non-null  object
 8   If "Other," please indicate the currency here:                                                                                                                                                                                        206 non-null    object
 9   If your income needs additional context, please provide it here:                                                                                                                                                                      3042 non-null   object
 10  What country do you work in?                                                                                                                                                                                                          28062 non-null  object
 11  If you're in the U.S., what state do you work in?                                                                                                                                                                                     23039 non-null  object
 12  What city do you work in?                                                                                                                                                                                                             27980 non-null  object
 13  How many years of professional work experience do you have overall?                                                                                                                                                                   28062 non-null  object
 14  How many years of professional work experience do you have in your field?                                                                                                                                                             28062 non-null  object
 15  What is your highest level of education completed?                                                                                                                                                                                    27840 non-null  object
 16  What is your gender?                                                                                                                                                                                                                  27891 non-null  object
 17  What is your race? (Choose all that apply.)                                                                                                                                                                                           27885 non-null  object
dtypes: float64(1), object(17)
memory usage: 3.9+ MB

Oh… Ugh! Give these columns easier names to work with first. 🙄

In [37]:
# Rename ‘em.
# Non-binding suggestions: timestamp, age, industry, title, title_context, salary, additional_compensation, currency, other_currency, salary_context, country, state, city, total_yoe, field_yoe, highest_education_completed	gender, race

new_column_names = {
    'Timestamp': 'timestamp',
    'How old are you?': 'age',
    'What industry do you work in?': 'industry',
    'Job title': 'title',
    'If your job title needs additional context, please clarify here:': 'title_context',
    'What is your annual salary? (You\'ll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)': 'salary',
    'How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.': 'additional_compensation',
    'Please indicate the currency': 'currency',
    'If "Other," please indicate the currency here: ': 'other_currency',
    'If your income needs additional context, please provide it here:': 'salary_context',
    'What country do you work in?': 'country',
    'If you\'re in the U.S., what state do you work in?': 'state',
    'What city do you work in?': 'city',
    'How many years of professional work experience do you have overall?': 'total_yoe',
    'How many years of professional work experience do you have in your field?': 'field_yoe',
    'What is your highest level of education completed?': 'highest_education_completed',
    'What is your gender?': 'gender',
    'What is your race? (Choose all that apply.)': 'race'
}

df_salary.rename(columns=new_column_names, inplace=True)

print(df_salary.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28062 entries, 0 to 28061
Data columns (total 18 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   timestamp                    28062 non-null  object
 1   age                          28062 non-null  object
 2   industry                     27988 non-null  object
 3   title                        28061 non-null  object
 4   title_context                7262 non-null   object
 5   salary                       28062 non-null  object
 6   additional_compensation      20766 non-null  float64
 7   currency                     28062 non-null  object
 8   other_currency               206 non-null    object
 9   salary_context               3042 non-null   object
 10  country                      28062 non-null  object
 11  state                        23039 non-null  object
 12  city                         27980 non-null  object
 13  total_yoe                    28062 non-null  object
 14  field_yoe                    28062 non-null  object
 15  highest_education_completed  27840 non-null  object
 16  gender                       27891 non-null  object
 17  race                         27885 non-null  object
dtypes: float64(1), object(17)
memory usage: 3.9+ MB
None

It’s a lot, and that should not have been easy. 😏

You’re going to have a gander at the computing/tech subset first because thats *your* industry. But first, what value corresponds to that `industry`?

In [38]:
# List the unique industries and a count of their instances.

industry_counts = df_salary['industry'].value_counts()

print(industry_counts)

industry
Computing or Tech                          4699
Education (Higher Education)               2464
Nonprofits                                 2419
Health care                                1896
Government and Public Administration       1889
                                           ...
Gaming (Gambling)                             1
Regulatory Affairs- nutraceuticals            1
Manufacturing : corporate admin support       1
Real Estate Investment Support                1
Wine & Spirits                                1
Name: count, Length: 1219, dtype: int64

That value among the top 5 is what you’re looking for innit? Filter out all the rows not in that industry and save it into a new dataframe.

In [41]:
# Filtery filter. (Save it to a new variable, df_salary_tech.)
df_salary_tech = df_salary[df_salary['industry'] == 'Computing or Tech']

print(df_salary_tech)

                timestamp    age           industry  \
1      4/27/2021 11:02:22  25-34  Computing or Tech
8      4/27/2021 11:03:01  45-54  Computing or Tech
43     4/27/2021 11:04:04  25-34  Computing or Tech
44     4/27/2021 11:04:04  25-34  Computing or Tech
46     4/27/2021 11:04:07  35-44  Computing or Tech
...                   ...    ...                ...
28050   7/1/2024 13:38:46  25-34  Computing or Tech
28051   7/1/2024 20:05:58  25-34  Computing or Tech
28052   7/3/2024 14:02:01  25-34  Computing or Tech
28058  7/23/2024 17:51:03  25-34  Computing or Tech
28060  7/26/2024 11:20:45  18-24  Computing or Tech

                                              title  \
1          Change & Internal Communications Manager
8                                   Systems Analyst
43                      Principal Software Engineer
44                             Intelligence Analyst
46                                 Mobile developer
...                                             ...
28050  Research & Systems Technician Data Analytics
28051                          Junior data analyst
28052        Senior Global Public Relations Manager
28058                             Systems Architect
28060                                            IT

                      title_context   salary  additional_compensation  \
1                               NaN   54,600                   4000.0
8      Data developer/ETL Developer  112,000                  10000.0
43                              NaN  187,500                   5000.0
44                              NaN  110,000                  20000.0
46                              NaN  144,600                   2500.0
...                             ...      ...                      ...
28050                           NaN    22000                      NaN
28051                           NaN    35000                  15000.0
28052                           NaN   144000                  15000.0
28058                           NaN   109000                      NaN
28060                           NaN     1700                     10.0

      currency other_currency                 salary_context         country  \
1          GBP            NaN                            NaN  United Kingdom
8          USD            NaN                            NaN              US
43         USD            NaN                            NaN   United States
44         USD            NaN  Around 20,000 a year in stock             USA
46         USD            NaN                            NaN             USA
...        ...            ...                            ...             ...
28050      EUR            NaN                            NaN           Spain
28051      USD            NaN                            NaN             Usa
28052      USD            NaN                            NaN             Usa
28058      USD            NaN                            NaN             USA
28060      USD            NaN                            NaN           Burma

               state                                          city  \
1                NaN                                     Cambridge
8           Missouri                                     St. Louis
43      Pennsylvania                                    Pittsburgh
44          Virginia                                 Arlington, VA
46     Massachusetts                                        Boston
...              ...                                           ...
28050            NaN                                     Barcelona
28051        Alabama                                      Alabama
28052  Massachusetts  Boise-but remote. Company located in Boston
28058        Georgia                                       Atlanta
28060            NaN                                        Yangon

           total_yoe       field_yoe highest_education_completed      gender  \
1       8 - 10 years       5-7 years              College degree  Non-binary
8      21 - 30 years   21 - 30 years              College degree       Woman
43      8 - 10 years       5-7 years              College degree       Woman
44      8 - 10 years    8 - 10 years             Master's degree         Man
46         5-7 years       5-7 years                         PhD       Woman
...              ...             ...                         ...         ...
28050    2 - 4 years     2 - 4 years              College degree         Man
28051    2 - 4 years     2 - 4 years              College degree       Woman
28052   8 - 10 years    8 - 10 years             Master's degree       Woman
28058      5-7 years       5-7 years              College degree         Man
28060    2 - 4 years  1 year or less                Some college         Man

                                      race
1                                    White
8                                    White
43                                   White
44                                   White
46                                   White
...                                    ...
28050  Hispanic, Latino, or Spanish origin
28051            Black or African American
28052                                White
28058                                White
28060              Asian or Asian American

[4699 rows x 18 columns]

Do a sanity check to make sure that the only values you kept are the one you are filtered for.

In [42]:
# Sanity Check 

print(df_salary_tech)

                timestamp    age           industry  \
1      4/27/2021 11:02:22  25-34  Computing or Tech
8      4/27/2021 11:03:01  45-54  Computing or Tech
43     4/27/2021 11:04:04  25-34  Computing or Tech
44     4/27/2021 11:04:04  25-34  Computing or Tech
46     4/27/2021 11:04:07  35-44  Computing or Tech
...                   ...    ...                ...
28050   7/1/2024 13:38:46  25-34  Computing or Tech
28051   7/1/2024 20:05:58  25-34  Computing or Tech
28052   7/3/2024 14:02:01  25-34  Computing or Tech
28058  7/23/2024 17:51:03  25-34  Computing or Tech
28060  7/26/2024 11:20:45  18-24  Computing or Tech

                                              title  \
1          Change & Internal Communications Manager
8                                   Systems Analyst
43                      Principal Software Engineer
44                             Intelligence Analyst
46                                 Mobile developer
...                                             ...
28050  Research & Systems Technician Data Analytics
28051                          Junior data analyst
28052        Senior Global Public Relations Manager
28058                             Systems Architect
28060                                            IT

                      title_context   salary  additional_compensation  \
1                               NaN   54,600                   4000.0
8      Data developer/ETL Developer  112,000                  10000.0
43                              NaN  187,500                   5000.0
44                              NaN  110,000                  20000.0
46                              NaN  144,600                   2500.0
...                             ...      ...                      ...
28050                           NaN    22000                      NaN
28051                           NaN    35000                  15000.0
28052                           NaN   144000                  15000.0
28058                           NaN   109000                      NaN
28060                           NaN     1700                     10.0

      currency other_currency                 salary_context         country  \
1          GBP            NaN                            NaN  United Kingdom
8          USD            NaN                            NaN              US
43         USD            NaN                            NaN   United States
44         USD            NaN  Around 20,000 a year in stock             USA
46         USD            NaN                            NaN             USA
...        ...            ...                            ...             ...
28050      EUR            NaN                            NaN           Spain
28051      USD            NaN                            NaN             Usa
28052      USD            NaN                            NaN             Usa
28058      USD            NaN                            NaN             USA
28060      USD            NaN                            NaN           Burma

               state                                          city  \
1                NaN                                     Cambridge
8           Missouri                                     St. Louis
43      Pennsylvania                                    Pittsburgh
44          Virginia                                 Arlington, VA
46     Massachusetts                                        Boston
...              ...                                           ...
28050            NaN                                     Barcelona
28051        Alabama                                      Alabama
28052  Massachusetts  Boise-but remote. Company located in Boston
28058        Georgia                                       Atlanta
28060            NaN                                        Yangon

           total_yoe       field_yoe highest_education_completed      gender  \
1       8 - 10 years       5-7 years              College degree  Non-binary
8      21 - 30 years   21 - 30 years              College degree       Woman
43      8 - 10 years       5-7 years              College degree       Woman
44      8 - 10 years    8 - 10 years             Master's degree         Man
46         5-7 years       5-7 years                         PhD       Woman
...              ...             ...                         ...         ...
28050    2 - 4 years     2 - 4 years              College degree         Man
28051    2 - 4 years     2 - 4 years              College degree       Woman
28052   8 - 10 years    8 - 10 years             Master's degree       Woman
28058      5-7 years       5-7 years              College degree         Man
28060    2 - 4 years  1 year or less                Some college         Man

                                      race
1                                    White
8                                    White
43                                   White
44                                   White
46                                   White
...                                    ...
28050  Hispanic, Latino, or Spanish origin
28051            Black or African American
28052                                White
28058                                White
28060              Asian or Asian American

[4699 rows x 18 columns]

We are very interested in salary figures. But how many dollars 💵 is a euro 💶 or a pound 💷? That sounds like a problem for another day. 🫠

For now, let’s just look at U.S. dollars (`'USD'`).

In [44]:
# Filtery filter for just the jobs that pay in USD!

df_salary_usd = df_salary_tech[df_salary_tech['currency'] == 'USD']

print(df_salary_usd)

                timestamp    age           industry  \
8      4/27/2021 11:03:01  45-54  Computing or Tech
43     4/27/2021 11:04:04  25-34  Computing or Tech
44     4/27/2021 11:04:04  25-34  Computing or Tech
46     4/27/2021 11:04:07  35-44  Computing or Tech
47     4/27/2021 11:04:09  35-44  Computing or Tech
...                   ...    ...                ...
28044   6/3/2024 16:15:43  18-24  Computing or Tech
28051   7/1/2024 20:05:58  25-34  Computing or Tech
28052   7/3/2024 14:02:01  25-34  Computing or Tech
28058  7/23/2024 17:51:03  25-34  Computing or Tech
28060  7/26/2024 11:20:45  18-24  Computing or Tech

                                        title                 title_context  \
8                             Systems Analyst  Data developer/ETL Developer
43                Principal Software Engineer                           NaN
44                       Intelligence Analyst                           NaN
46                           Mobile developer                           NaN
47                    Product Design Director                           NaN
...                                       ...                           ...
28044         Research Data Analyst Associate                           NaN
28051                    Junior data analyst                            NaN
28052  Senior Global Public Relations Manager                           NaN
28058                       Systems Architect                           NaN
28060                                      IT                           NaN

        salary  additional_compensation currency other_currency  \
8      112,000                  10000.0      USD            NaN
43     187,500                   5000.0      USD            NaN
44     110,000                  20000.0      USD            NaN
46     144,600                   2500.0      USD            NaN
47     200,850                  40000.0      USD            NaN
...        ...                      ...      ...            ...
28044    60000                      0.0      USD            NaN
28051    35000                  15000.0      USD            NaN
28052   144000                  15000.0      USD            NaN
28058   109000                      NaN      USD            NaN
28060     1700                     10.0      USD            NaN

                      salary_context        country           state  \
8                                NaN             US        Missouri
43                               NaN  United States    Pennsylvania
44     Around 20,000 a year in stock            USA        Virginia
46                               NaN            USA   Massachusetts
47                               NaN            USA  North Carolina
...                              ...            ...             ...
28044                            NaN  United States        Illinois
28051                            NaN            Usa         Alabama
28052                            NaN            Usa   Massachusetts
28058                            NaN            USA         Georgia
28060                            NaN          Burma             NaN

                                               city      total_yoe  \
8                                         St. Louis  21 - 30 years
43                                       Pittsburgh   8 - 10 years
44                                    Arlington, VA   8 - 10 years
46                                           Boston      5-7 years
47                                      Chapel Hill  11 - 20 years
...                                             ...            ...
28044                                      Evanston    2 - 4 years
28051                                      Alabama     2 - 4 years
28052  Boise-but remote. Company located in Boston    8 - 10 years
28058                                       Atlanta      5-7 years
28060                                        Yangon    2 - 4 years

            field_yoe highest_education_completed gender  \
8       21 - 30 years              College degree  Woman
43          5-7 years              College degree  Woman
44       8 - 10 years             Master's degree    Man
46          5-7 years                         PhD  Woman
47      11 - 20 years              College degree  Woman
...               ...                         ...    ...
28044  1 year or less              College degree  Woman
28051     2 - 4 years              College degree  Woman
28052    8 - 10 years             Master's degree  Woman
28058       5-7 years              College degree    Man
28060  1 year or less                Some college    Man

                            race
8                          White
43                         White
44                         White
46                         White
47                         White
...                          ...
28044                      White
28051  Black or African American
28052                      White
28058                      White
28060    Asian or Asian American

[3777 rows x 18 columns]

What we really want know is how each U.S. city pays in tech. What value in `country` represents the United States of America?

In [45]:
# We did filter for USD, so if we do a count of each unique country in descending count order, the relevant value(s) should show up at the top.

country_counts = df_salary_usd['country'].value_counts()

print(country_counts)

country
United States               1576
USA                         1222
US                           412
U.S.                         108
United States of America      90
                            ...
Pakistan                       1
Puerto Rico                    1
America                        1
Uniyed states                  1
Burma                          1
Name: count, Length: 76, dtype: int64

### Clean the Data

Well, we can’t get our answers with what we currently have, so you’ll have to make some changes.

Let’s not worry about anything below the first 5 values for now. Convert the top 5 to a single canonical value―say, `'US'`, which is nice and short.

In [48]:
# Replace them all with 'US'.

us_mapping = {
    'United States': 'US',
    'USA': 'US',
    'US': 'US',
    'U.S.': 'US',
    'United States of America': 'US'
}

df_salary_usd['country'] = df_salary_usd['country'].replace(us_mapping)

print(df_salary_usd['country'].value_counts().head(10))

df_salary_usd

country
US                3408
United States       68
Usa                 59
USA                 56
usa                 28
United states       23
united states       14
Us                  12
us                   9
U.S.A.               7
Name: count, dtype: int64

/var/folders/5j/xjmzb8ms71s1xcbngys2vw9h0000gn/T/ipykernel_18230/1572346633.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary_usd['country'] = df_salary_usd['country'].replace(us_mapping)

,timestamp,age,industry,title,title_context,salary,additional_compensation,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_education_completed,gender,race
8,4/27/2021 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,"112,000",10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,4/27/2021 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,"187,500",5000.0,USD,NaN,NaN,US,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,4/27/2021 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,"110,000",20000.0,USD,NaN,"Around 20,000 a year in stock",US,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,4/27/2021 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,"144,600",2500.0,USD,NaN,NaN,US,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White
47,4/27/2021 11:04:09,35-44,Computing or Tech,Product Design Director,NaN,"200,850",40000.0,USD,NaN,NaN,US,North Carolina,Chapel Hill,11 - 20 years,11 - 20 years,College degree,Woman,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
28044,6/3/2024 16:15:43,18-24,Computing or Tech,Research Data Analyst Associate,NaN,60000,0.0,USD,NaN,NaN,US,Illinois,Evanston,2 - 4 years,1 year or less,College degree,Woman,White
28051,7/1/2024 20:05:58,25-34,Computing or Tech,Junior data analyst,NaN,35000,15000.0,USD,NaN,NaN,Usa,Alabama,Alabama,2 - 4 years,2 - 4 years,College degree,Woman,Black or African American
28052,7/3/2024 14:02:01,25-34,Computing or Tech,Senior Global Public Relations Manager,NaN,144000,15000.0,USD,NaN,NaN,Usa,Massachusetts,Boise-but remote. Company located in Boston,8 - 10 years,8 - 10 years,Master's degree,Woman,White
28058,7/23/2024 17:51:03,25-34,Computing or Tech,Systems Architect,NaN,109000,NaN,USD,NaN,NaN,US,Georgia,Atlanta,5-7 years,5-7 years,College degree,Man,White
28060,7/26/2024 11:20:45,18-24,Computing or Tech,IT,NaN,1700,10.0,USD,NaN,NaN,Burma,NaN,Yangon,2 - 4 years,1 year or less,Some college,Man,Asian or Asian American

Have a look at the count of each unique country again now.

In [49]:
# Count again.

print(df_salary_usd['country'].value_counts().head(10))

country
US                3408
United States       68
Usa                 59
USA                 56
usa                 28
United states       23
united states       14
Us                  12
us                   9
U.S.A.               7
Name: count, dtype: int64

Did you notice anything interesting?

In [ ]:
# BONUS CREDIT: resolve [most of] those anomalous cases too without exhaustively taking every variant literally into account.

In [ ]:

# BONUS CREDIT: if you’ve resolved it, let’s see how well you did by counting the number of instances of each unique value.

It’s looking good so far. Let’s find out the minimum, mean, and maximum (in that order) salary by state, sorted by the mean in descending order.

In [52]:
# Find the minimum, mean, and maximum salary in USD by U.S. state.

salary_stats_by_state = df_salary_usd.groupby('state')['salary'].agg(['min', 'mean', 'max'])

print(salary_stats_by_state)

                                    min           mean       max
state
Alabama                         35000.0  117400.000000  350000.0
Alabama, District of Columbia       NaN            NaN       NaN
Alabama, Montana                    NaN            NaN       NaN
Alaska                              NaN            NaN       NaN
Arizona                         35000.0   97833.333333  145000.0
...                                 ...            ...       ...
Vermont                         91250.0  105625.000000  120000.0
Virginia                        58750.0  115086.696970  378000.0
Washington                         72.0  136923.916667  300000.0
West Virginia                  120000.0  120000.000000  120000.0
Wisconsin                           1.0  145806.888889  920000.0

[66 rows x 3 columns]

Well, pooh! We forgot that `salary` isn’t numeric. Something wrong must be fixed.

In [53]:
# Fix it.

df_salary_usd['salary'] = df_salary_usd['salary'].replace({'\$': '', ',': ''}, regex=True)

df_salary_usd['salary'] = pd.to_numeric(df_salary_usd['salary'], errors='coerce')

print(df_salary_usd['salary'].head())

8    NaN
43   NaN
44   NaN
46   NaN
47   NaN
Name: salary, dtype: float64

/var/folders/5j/xjmzb8ms71s1xcbngys2vw9h0000gn/T/ipykernel_18230/549462897.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary_usd['salary'] = df_salary_usd['salary'].replace({'\$': '', ',': ''}, regex=True)
/var/folders/5j/xjmzb8ms71s1xcbngys2vw9h0000gn/T/ipykernel_18230/549462897.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary_usd['salary'] = pd.to_numeric(df_salary_usd['salary'], errors='coerce')

Let’s try that again.

In [54]:
# Try it again. Yeah!
print(salary_stats_by_state)

                                    min           mean       max
state
Alabama                         35000.0  117400.000000  350000.0
Alabama, District of Columbia       NaN            NaN       NaN
Alabama, Montana                    NaN            NaN       NaN
Alaska                              NaN            NaN       NaN
Arizona                         35000.0   97833.333333  145000.0
...                                 ...            ...       ...
Vermont                         91250.0  105625.000000  120000.0
Virginia                        58750.0  115086.696970  378000.0
Washington                         72.0  136923.916667  300000.0
West Virginia                  120000.0  120000.000000  120000.0
Wisconsin                           1.0  145806.888889  920000.0

[66 rows x 3 columns]

That did the trick! Now let’s narrow this to data 2021 and 2022 just because (lel). *(Hint: that timestamp column may not be a temporal type right now.)*

In [56]:
# Filter the data to within 2021, 2022, or 2023, saving the DataFrame to a new variable, and generate the summary again.

df_salary_usd['timestamp'] = pd.to_datetime(df_salary_usd['timestamp'], errors='coerce')

df_filtered = df_salary_usd[df_salary_usd['timestamp'].dt.year.isin([2021, 2022, 2023])]

print(df_filtered)

                timestamp    age           industry  \
8     2021-04-27 11:03:01  45-54  Computing or Tech
43    2021-04-27 11:04:04  25-34  Computing or Tech
44    2021-04-27 11:04:04  25-34  Computing or Tech
46    2021-04-27 11:04:07  35-44  Computing or Tech
47    2021-04-27 11:04:09  35-44  Computing or Tech
...                   ...    ...                ...
27960 2023-05-09 17:57:30  45-54  Computing or Tech
27961 2023-05-28 16:10:53  45-54  Computing or Tech
27971 2023-08-08 07:12:10  25-34  Computing or Tech
27975 2023-09-08 12:35:45  18-24  Computing or Tech
27989 2023-10-26 08:17:05  18-24  Computing or Tech

                             title                 title_context   salary  \
8                  Systems Analyst  Data developer/ETL Developer      NaN
43     Principal Software Engineer                           NaN      NaN
44            Intelligence Analyst                           NaN      NaN
46                Mobile developer                           NaN      NaN
47         Product Design Director                           NaN      NaN
...                            ...                           ...      ...
27960          Junior Data Analyst                           NaN  65000.0
27961                 Data Analyst                           NaN  65000.0
27971               Data scientist                           NaN    500.0
27975                       intern                           NaN  35000.0
27989                      Ibterb                            NaN    456.0

       additional_compensation currency other_currency  \
8                      10000.0      USD            NaN
43                      5000.0      USD            NaN
44                     20000.0      USD            NaN
46                      2500.0      USD            NaN
47                     40000.0      USD            NaN
...                        ...      ...            ...
27960                      0.0      USD            NaN
27961                      0.0      USD            NaN
27971                      NaN      USD            NaN
27975                      0.0      USD            NaN
27989                      NaN      USD            NaN

                      salary_context   country           state           city  \
8                                NaN        US        Missouri      St. Louis
43                               NaN        US    Pennsylvania     Pittsburgh
44     Around 20,000 a year in stock        US        Virginia  Arlington, VA
46                               NaN        US   Massachusetts         Boston
47                               NaN        US  North Carolina    Chapel Hill
...                              ...       ...             ...            ...
27960                            NaN        US        Virginia       Richmond
27961                            NaN        US        New York          Bronx
27971                            NaN     Ghana             NaN          Accra
27975                            NaN        US           Texas         Dallas
27989                            NaN  Nigeria              NaN          Lagos

            total_yoe       field_yoe highest_education_completed gender  \
8       21 - 30 years   21 - 30 years              College degree  Woman
43       8 - 10 years       5-7 years              College degree  Woman
44       8 - 10 years    8 - 10 years             Master's degree    Man
46          5-7 years       5-7 years                         PhD  Woman
47      11 - 20 years   11 - 20 years              College degree  Woman
...               ...             ...                         ...    ...
27960   21 - 30 years  1 year or less              College degree    Man
27961   21 - 30 years    8 - 10 years              College degree    Man
27971     2 - 4 years     2 - 4 years              College degree    Man
27975  1 year or less  1 year or less             Master's degree    Man
27989     2 - 4 years     2 - 4 years              College degree    Man

                                                    race
8                                                  White
43                                                 White
44                                                 White
46                                                 White
47                                                 White
...                                                  ...
27960                                              White
27961                          Black or African American
27971                          Black or African American
27975                            Asian or Asian American
27989  Another option not listed here or prefer not t...

[3764 rows x 18 columns]

/var/folders/5j/xjmzb8ms71s1xcbngys2vw9h0000gn/T/ipykernel_18230/2652158851.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary_usd['timestamp'] = pd.to_datetime(df_salary_usd['timestamp'], errors='coerce')

## Bonus

Clearly, we do not have enough data to produce useful figures for the level of specificity you’ve now reached. What do you notice about Delaware and West Virginia?

Let’s back out a bit and return to `df_salary` (which was the loaded data with renamed columns but *sans* filtering).

### Bonus #0

Apply the same steps as before to `df_salary`, but do not filter for any specific industry. Do perform the other data cleaning stuff, and get to a point where you can generate the minimum, mean, and maximum by state.

### Bonus #1

This time, format the table output nicely (*$12,345.00*) without modifying the values in the `DataFrame`. That is, `df_salary` should be identical before versus after running your code.

(*Hint: if you run into an error about `jinja2` perhaps you need to `pip install` something.*)

### Bonus #2

Filter out the non-single-states (e.g., `'California, Colorado'`) in the most elegant way possible (i.e., *not* by blacklisting all the bad values).

### Bonus #3

Show the quantiles instead of just minimum, mean, and maximum―say 0%, 5%, 25%, 50%, 75%, 95%, and 100%. Outliers may be deceiving.

Sort by whatever interests you―like say the *50th* percentile.

And throw in a count by state too. It would be interesting to know how many data points contribute to the figures for each state. (*Hint: your nice formatting from Bonus #1 might not work this time around.* 😜)